package lesson4.while_do;

import java.util.Scanner;

public class While {
    public static void main(String[] args) {
         /*while(условие)
    {
        тело цикло выполняется до тех пор пока
        условие true
    }*/
        //break выходит из цикла
        //continue завершает итерацию и уходит на следующий круг

        //Пример у вас соц сеть в которую можно загружать фотографии
        //у пользователя с консоли спрашивают сколько фотографий
        //он хотел бы загрузить в свой альбом
        //но есть ограничение по размеру альбома в 100 фотографий

    }

}
