package lesson5.arrays;

public class General {
    public static void main(String[] args) {
        //Массив – это структура данныx, хранящее определенное количество элементов одного типа.
        //По умолчанию все значения массива 0, либо null в зависимости от типа объекта
        //Способы инициализации массива:

        //1)Вручную:

        //2)for

        //3){}

        //Вывести все элементы массива используя цикл for

        //Заполнить одномерный массив из 10 элементов случайными числами из
        //диапазона от -10 до 10.
        /*int[] array = new int[10];
        for (int i = 0; i < array.length; i++) {
            array[i] = ((int) (Math.random() * 21)-10);
        }
        for (int i = 0; i < array.length; i++){
            System.out.print(array[i]+" ");
        }*/

        // Многомерные массивы.
        // Двумерный массив – это массив массивов.

    }

}
